ЭкзаменационнаяЗадача/src/Documents/ПеремещениеКниг/ПеремещениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеКниг</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.БронированиеТоваров</registerRecords>
  <attributes>
    <name>СкладОтправки</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПриема</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКниг</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/Documents/ПеремещениеКниг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.СкладОтправки = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКниги(Команда)

	ОписаниеОповещения 				= Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);
	ПараметрыФормы 	= Новый Структура("Склад", Объект.СкладОтправки);
	ОткрытьФорму("Документ.ПеремещениеКниг.Форма.ФормаВыбораДоступныхКниг", ПараметрыФормы, , , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда

		Возврат;

	КонецЕсли;
	Для Каждого ТекущаяСтрока Из ВыбранноеЗначение Цикл

		Отбор 				= Новый Структура("Книга", ТекущаяСтрока.Книга);
		НайденныеЭлементы 	= Объект.СписокКниг.НайтиСтроки(Отбор);

		Если НайденныеЭлементы.Количество() > 0 Тогда

			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.СписокКниг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
